Revit 2026 API

# MEPSectionFlow Property

---

The flow of the section.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Flow { get; }
```
```vb
Public ReadOnly Property Flow As Double
	Get
```
```cpp
public:
property double Flow {
	double get ();
}
```
```fsharp
member Flow : float with get
```

#### Property Value

Double

In one section, all section members have same flow. Default unit is Cubic feet per second. For Duct, unit type is UT_HVAC_Airflow. For Pipe, unit type is UT_Piping_Flow

#### Reference

MEPSection Class

Autodesk.Revit.DB.Mechanical Namespace